<?php

$array_err = array(
	'err_login_null' => '* Необходимо указать Логин',
	'err_login_pattern' => '* Логин должен содержать минимум 6 символов',
	'err_password_null' => '* Необходимо указать Пароль',
	'err_password_pattern' => '* Пароль должен содержать минимум 6 символов и обязательно должен состоять из цифр и букв',
	'err_conf_pass_null' => '* Необходимо повторить Пароль',
	'err_confirm_password' => '* Указанный повторно пароль не совпадает с изначальным паролем',
	'err_email_null' => '* Необходимо ввести электронную почту',
	'err_email_pattern' => '* Необходимо ввести корректный E-mail',
	'err_username_null' => '* Необходимо ввести свое Имя',
	'err_username_pattern' => '* Имя должно содержать только две буквы',
	'err_login_copy' => '* Пользователь с таким Логином уже существует',
	'err_email_copy' => '* Пользователь с таким E-mail уже существует',
	'err_login_pass' => '* Логин и Пароль не совпадают. Попробуйте еще раз',
	'err_login_bd' => '* Пользователь не обнаружен в базе данных. Зарегистрируйстесь, пожалуйста',
	'err_signup' => "Перейдите <a href=\"index.php\"> на главную страницу</a> и зарегистрируйтесь",
	'yes_signup' => "Вы успешно зарегистрированы. Перейдите <a href=\"index.php\"> на главную страницу</a>, чтобы авторизоваться"
);

?>